[
 {
    "id": "post_1709251200000",
    "title": "Staying on Task",
    "tag": "Commentary",
    "excerpt": "There is always a shiny new toy to catch my eye. Allegory helps me stay focused on the task at hand.",
    "body": "Staying on task has been the hardest thing to do while learning about investing. There is always a shiny new toy to catch my eye, whether it be a new spin-off, merger, news story, or global economic event. I know I cannot learn everything all at once, but I keep trying to — that is part of the reason I made this blog. I want to set clear goals and hold myself accountable. If I know people expect to see results from me, I am sure it will help me stay on task. I almost got distracted today with oil prices and the possibility of the Strait of Hormuz being cut off. If I had more extensive knowledge and decades worth of experience, I may have taken action, but Allegory proved useful. I have a task at hand already. If I go off on a tangent I might learn something, but I cannot devote a whole week to it. I know I am not going to act on the news and I would be too late anyway. I will of course continue to keep up with current events and observe how the market reacts, but I already have a task at hand.\n\nThe new microcap list will come out tomorrow as March begins. I remind you, those that stay on the list will keep their percent change from the previous month. As far as the full analyst briefs go, I am still working on the automated system. There have been a few hiccups, so I am working on how to mesh my AI tools with Python scripts that pull data from the SEC's website. The biggest problem I have faced with the AI tools is that they need a hard-stop factual baseline. When pulling from SEC filings, they can mix up different data points if the API defines figures with different names — for instance earnings can be named, \"Last Twelve Months Earnings From Sector X\" as opposed to \"TTM.\", or anything in between. Each filer has a different classification that can confuse the system. Right now I am working to automate a hard-stop reference point. Once I can pin that down, I believe I will be able to provide error-free coverages to you.\n\nAs for my role in the project, to continue building my fundamental skills I will be picking a company from the new top 10 ranking to do a deep dive on for you all. I will forecast the company and do my own writeup separate from the AI and Python writeups I am working on. This will be published when done or by the end of the month. I do not know how long it will take, as the last writeup I did was mostly a learning process so it took longer. I look forward to continuing to document my progress and interacting as this site grows.",
    "status": "published",
    "createdAt": "2026-03-01T00:00:00.000Z",
    "updatedAt": "2026-03-01T00:00:00.000Z"
  },

  {
    "id": "post_1771644374954",
    "title": "Welcome to Alleogry",
    "tag": "Outlook",
    "excerpt": "Allegory will document my journey from a bootstrapped dorm room operation to a fully functioning hedge fund.",
    "body": "This is my first full entry here on Allegory, and while I expect the writing to sharpen over time, you have to start somewhere. So here it is.\nAllegory will document my journey from a bootstrapped dorm room operation to a fully functioning hedge fund. I currently have roughly $2,100 in my brokerage account. Between my part-time internship and the future revenues of this site, I intend to grow that number and bring you along for the ride.\n\n**The Problem**\nI am currently building a set of tools that I will be releasing here shortly. The first one was born out of frustration.\nI would set screening parameters on ThinkorSwim, and thousands of tickers would flood the screen  prices, volumes, percent changes, the works. The first time I decided to take a deep dive on one of those names, I got lucky. After hours of reading through tickers, pulling up company websites, earnings releases, and other filings, I landed on a company with a compelling story. It was in the middle of a turnaround, and by the end of my analysis I felt confident it was a good buy.\nThe problem was the process. I had no way of knowing whether I would get that luck again, or if I would waste two hours scanning tickers and then spend days digging into a single name with nothing to show for it.\n\n**The Solution**\nI built something better. I wrote a Python program that scans all 7,000+ microcap stocks listed on the NYSE and NASDAQ. The program evaluates each company on a quantitative basis to determine whether it warrants further analysis. It first applies a set of automatic disqualifiers to clear out the obvious noise, then uses metrics like revenue trends, FCF yield, ROIC, ROE, and P/B ratio (among others) to rank the remaining universe and surface the top 50.\n\n**What You Can Expect**\nMy goal is straightforward. I will further filter that top 50 and publish the top 10 here on the site as a resource for you. Once my next project is complete, I will begin posting full analyst-level research on the top 5 companies. Both lists will be updated monthly.\nMost microcap stocks receive zero coverage from major banks. I am building Allegory to be a resource for retail investors who do their own work and for smaller funds whose position sizing allows them to operate in the microcap space.\nThat is what I am working on now. I will keep uploading information and stress testing my models. The more work I put in, the more I learn, and the more I can provide for you. I look forward to building this, and I hope it earns your attention.",
    "status": "published",
    "createdAt": "2026-02-21T03:26:14.953Z",
    "updatedAt": "2026-02-21T03:26:14.953Z"
  }
]