[
  {
    "id": "post_1771644374954",
    "title": "Welcome to Alleogry",
    "tag": "Outlook",
    "excerpt": "Allegory will document my journey from a bootstrapped dorm room operation to a fully functioning hedge fund.",
    "body": "This is my first full entry here on Allegory, and while I expect the writing to sharpen over time, you have to start somewhere. So here it is.\nAllegory will document my journey from a bootstrapped dorm room operation to a fully functioning hedge fund. I currently have roughly $2,100 in my brokerage account. Between my part-time internship and the future revenues of this site, I intend to grow that number and bring you along for the ride.\n\n**The Problem**\nI am currently building a set of tools that I will be releasing here shortly. The first one was born out of frustration.\nI would set screening parameters on ThinkorSwim, and thousands of tickers would flood the screen  prices, volumes, percent changes, the works. The first time I decided to take a deep dive on one of those names, I got lucky. After hours of reading through tickers, pulling up company websites, earnings releases, and other filings, I landed on a company with a compelling story. It was in the middle of a turnaround, and by the end of my analysis I felt confident it was a good buy.\nThe problem was the process. I had no way of knowing whether I would get that luck again, or if I would waste two hours scanning tickers and then spend days digging into a single name with nothing to show for it.\n\n**The Solution**\nI built something better. I wrote a Python program that scans all 7,000+ microcap stocks listed on the NYSE and NASDAQ. The program evaluates each company on a quantitative basis to determine whether it warrants further analysis. It first applies a set of automatic disqualifiers to clear out the obvious noise, then uses metrics like revenue trends, FCF yield, ROIC, ROE, and P/B ratio (among others) to rank the remaining universe and surface the top 50.\n\n**What You Can Expect**\nMy goal is straightforward. I will further filter that top 50 and publish the top 10 here on the site as a resource for you. Once my next project is complete, I will begin posting full analyst-level research on the top 5 companies. Both lists will be updated monthly.\nMost microcap stocks receive zero coverage from major banks. I am building Allegory to be a resource for retail investors who do their own work and for smaller funds whose position sizing allows them to operate in the microcap space.\nThat is what I am working on now. I will keep uploading information and stress testing my models. The more work I put in, the more I learn, and the more I can provide for you. I look forward to building this, and I hope it earns your attention.",
    "status": "published",
    "createdAt": "2026-02-21T03:26:14.953Z",
    "updatedAt": "2026-02-21T03:26:14.953Z"
  }
]